app/controllers/store_controller.rb

  def remove_from_cart
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 2)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2010-04-07 14:31:45', 29.95, 2, 1, '2010-04-07 14:31:45')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Heber Massami Nunomura', '2010-04-07 14:31:45', 'cc', 'rua Maranhao 584', 'heber28@gmail.com', '2010-04-07 14:31:45')